In [20]:
import pandas as pd

df=pd.read_excel('1.xlsx',sheet_name='Sheet1')

df

      Name  Age         City  Pincode
0     Tony   29          USA     5423
1     Thor   25       Asgard     1236
2  Natasha   19          USA     5468
3     Bush   30          USA     4569
4  Tichala   28      Wakanda     2365
5   Naruto   26  Hidden Leaf     5621
6     Goku   18  Mount Paccu     5632
7      Guy   22        Korea     1236

In [21]:
df=pd.read_csv('1.csv')

df

      Name  Age         City  Pincode
0     Tony   29          USA     5423
1     Thor   25       Asgard     1236
2  Natasha   19          USA     5468
3     Bush   30          USA     4569
4  Tichala   28      Wakanda     2365
5   Naruto   26  Hidden Leaf     5621
6     Goku   18  Mount Paccu     5632
7      Guy   22        Korea     1236

In [22]:

df.describe()

             Age      Pincode
count   8.000000     8.000000
mean   24.625000  3943.750000
std     4.533605  1990.049658
min    18.000000  1236.000000
25%    21.250000  2082.750000
50%    25.500000  4996.000000
75%    28.250000  5506.250000
max    30.000000  5632.000000

In [40]:
df.head()

            Name  Pincode
City
USA         Tony     5423
Asgard      Thor     1236
USA      Natasha     5468
USA         Bush     4569
Wakanda  Tichala     2365

In [39]:
df.tail()

                Name  Pincode
City
USA             Bush     4569
Wakanda      Tichala     2365
Hidden Leaf   Naruto     5621
Mount Paccu     Goku     5632
Korea            Guy     1236

In [25]:
# df.index=["First","Second","Third","Fourth","fifth","sixth","seventh","eight"]

# df

In [26]:
df.columns

Index(['Name', 'Age', 'City', 'Pincode'], dtype='object')

In [27]:


df['Age']

0    29
1    25
2    19
3    30
4    28
5    26
6    18
7    22
Name: Age, dtype: int64

In [28]:
df.Name

0       Tony
1       Thor
2    Natasha
3       Bush
4    Tichala
5     Naruto
6       Goku
7        Guy
Name: Name, dtype: object

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
df[["Pincode","Name"]]

   Pincode     Name
0     5423     Tony
1     1236     Thor
2     5468  Natasha
3     4569     Bush
4     2365  Tichala
5     5621   Naruto
6     5632     Goku
7     1236      Guy

In [31]:
df["Age"].max()

np.int64(30)

In [32]:
df["Age"].mean()

np.float64(24.625)

In [33]:
df["Age"].min()

np.int64(18)

In [34]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [37]:
print(df.columns)

Index(['Name', 'City', 'Pincode'], dtype='object')

In [38]:
df.set_index("City",inplace=True)